Public Member Functions | Friends | List of all members
ACAPI::DesignOptions::v1::DesignOptionManager Class Reference
Design Options
A class that contains design option related functions. More...
#include <DesignOptionManager.hpp>
 Inheritance diagram for ACAPI::DesignOptions::v1::DesignOptionManager:
 Public Member Functions
Result< DesignOptionCombinationViewSettings >  | GetDesignOptionCombinationSettingsOf (const ACAPI::ModelViews::v1::View &view) const
Result< std::vector< DesignOptionCombination > >  | GetAvailableDesignOptionCombinations () const
 Public Member Functions inherited from ACAPI::v1::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
 DesignOptionManager  | v1::CreateDesignOptionManager ()
 Result< DesignOptionManager >  | ACAPI::DesignOptions::v2::CreateDesignOptionManager ()
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::v1::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::v1::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
A class that contains design option related functions.
Since
Archicad 27
Member Function Documentation
◆ GetAvailableDesignOptionCombinations()
 Result< std::vector< DesignOptionCombination > > ACAPI::DesignOptions::v1::DesignOptionManager::GetAvailableDesignOptionCombinations  |  ( |   | ) |   const
Returns
A list of the available design option combinations in the project.
Example code snippets from Test / Design Options
 ACAPI::Result<ACAPI::DesignOptions::DesignOptionManager> manager = CreateDesignOptionManager ();
 if (manager.IsErr ()) {
 WriteReport ("Failed to get Design Option Manager.");
 return;
 }
 const auto combinations = manager->GetAvailableDesignOptionCombinations ();
 if (combinations.IsErr ()) {
 WriteReport ("Failed to get available design option combinations.");
 return;
 }
 for (const auto& combination : combinations.Unwrap ()) {
 WriteReport ("%s (%s)", combination.GetName ().ToCStr ().Get (), combination.GetGuid ().ToUniString ().ToCStr ().Get ());
 }
◆ GetDesignOptionCombinationSettingsOf()
 Result< DesignOptionCombinationViewSettings > ACAPI::DesignOptions::v1::DesignOptionManager::GetDesignOptionCombinationSettingsOf  |  ( |  const ACAPI::ModelViews::v1::View &  |  view | ) |   const
Returns
The design option combination of a view.
Parameters
view | The view of which the design option combniation is requested.
Example code snippets from Test / Design Options
Get
 ACAPI::Result<ACAPI::DesignOptions::DesignOptionManager> manager = CreateDesignOptionManager ();
 if (manager.IsErr ()) {
 WriteReport ("Failed to get Design Option Manager.");
 return;
 }
 for (const API_NavigatorItem& item : mapItems.Unwrap ()) {
 const ACAPI::Result<ACAPI::ModelViews::View> view = ACAPI::ModelViews::FindViewByGuid (item.guid);
 if (view.IsErr ()) {
 continue;
 }
 const ACAPI::Result<ACAPI::DesignOptions::DesignOptionCombinationViewSettings> settings =
 manager->GetDesignOptionCombinationSettingsOf (view.Unwrap ());
 if (settings.IsErr ()) {
 continue;
 }
 const ACAPI::Result<ACAPI::DesignOptions::DesignOptionCombinationViewSettings::Status> status = settings->GetStatus ();
 if (status.IsErr ()) {
 continue;
 }
 const GS::UniString itemId (item.uiId);
 const GS::UniString itemIdPrefix = !itemId.IsEmpty () ? itemId + " " : GS::EmptyUniString;
 const GS::UniString itemName (item.uName);
 const GS::UniString fullName = itemIdPrefix + itemName;
 std::visit (GS::Overloaded {
 [&fullName] (const ACAPI::DesignOptions::DesignOptionCombinationViewSettings::MainModelOnly&) {
 WriteReport ("%s: Main Model Only.", fullName.ToCStr ().Get ());
 },
 [&fullName] (const ACAPI::DesignOptions::DesignOptionCombinationViewSettings::Standard& standard) {
 WriteReport ("%s: %s.", fullName.ToCStr ().Get (), standard.combination.GetName ().ToCStr ().Get ());
 },
 [&fullName] (const ACAPI::DesignOptions::DesignOptionCombinationViewSettings::Custom& /*custom*/) {
 WriteReport ("%s: Custom.", fullName.ToCStr ().Get ());
 },
 [&fullName] (const ACAPI::DesignOptions::DesignOptionCombinationViewSettings::Missing&) {
 WriteReport ("%s: Missing.", fullName.ToCStr ().Get ());
 },
 }, status.Unwrap ());
 }
 Set
 const ACAPI::Result<std::vector<API_NavigatorItem>> mapItems = GetLeafNavigatorItems (API_PublicViewMap);
 if (mapItems.IsErr ()) {
 WriteReport ("Failed to get navigator map items.");
 return;
 }
 ACAPI::Result<ACAPI::DesignOptions::DesignOptionManager> manager = CreateDesignOptionManager ();
 if (manager.IsErr ()) {
 WriteReport ("Failed to get Design Option Manager.");
 return;
 }
 for (const API_NavigatorItem& item : mapItems.Unwrap ()) {
 const ACAPI::Result<ACAPI::ModelViews::View> view = ACAPI::ModelViews::FindViewByGuid (item.guid);
 if (view.IsErr ()) {
 continue;
 }
 ACAPI::Result<ACAPI::DesignOptions::DesignOptionCombinationViewSettings> settings =
 manager->GetDesignOptionCombinationSettingsOf (view.Unwrap ());
 if (settings.IsErr ()) {
 continue;
 }
 settings->Modify ([] (ACAPI::DesignOptions::DesignOptionCombinationViewSettings::Modifier& modifier) {
 modifier.SetMainModelOnly ();
 });
 }